thanhhaibk96/ARM-Microcontroller-Projects/AUV_Board_STM32F4_1_v3_edited_for_project/FatFs/diskio.c
/*------------------------------------------------------------------------*/
/* STM32F100: MMCv3/SDv1/SDv2 (SPI mode) control module                   */
/*------------------------------------------------------------------------*/
/*
/  Copyright (C) 2018, ChaN, all right reserved.
/
/ * This software is a free software and there is NO WARRANTY.
/ * No restriction on use. You can use, modify and redistribute it for
/   personal, non-profit or commercial products UNDER YOUR RESPONSIBILITY.
/ * Redistributions of source code must retain the above copyright notice.
/
/-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------

   Module Private Functions

---------------------------------------------------------------------------*/

#include "ff.h"
#include "diskio.h"
#include "stm32f4xx.h"
#include "my_delay.h"
#include "stm32f4xx_spi.h"
#include "stm32f4xx_rcc.h"
#include "misc.h"

/* Configure Hardware*/
//Timer
#define 	UFATFS_TIM  				      		TIM7
#define 	UFATFS_TIM_CLK					 	 		RCC_APB1Periph_TIM7	
#define 	UFATFS_TIM_CLK_Cmd    				RCC_APB1PeriphClockCmd
#define   UFATFS_TIM_IRQn								TIM7_IRQn

#define 	UFATFS_TIM_IRQHandler					TIM7_IRQHandler

#define 	UFATFS_CD_PIN  				   	GPIO_Pin_4			
#define 	UFATFS_CD_PORT 				  	GPIOC
#define 	UFATFS_CD_CLK							RCC_AHB1Periph_GPIOC			
#define 	UFATFS_CD_SOURCE				 	GPIO_PinSource4				
#define		UFATFS_CD_CLK_Cmd		  	 	RCC_AHB1PeriphClockCmd	

//SPI
#define 	UFATFS_NSS_PIN  				   	GPIO_Pin_4			
#define 	UFATFS_NSS_PORT 				  	GPIOA
#define 	UFATFS_NSS_CLK							RCC_AHB1Periph_GPIOA			
#define 	UFATFS_NSS_SOURCE				 		GPIO_PinSource4				
#define		UFATFS_NSS_CLK_Cmd		  	 	RCC_AHB1PeriphClockCmd			

#define 	UFATFS_SCK_PIN  				   	GPIO_Pin_5
#define 	UFATFS_SCK_PORT 				  	GPIOA
#define 	UFATFS_SCK_CLK							RCC_AHB1Periph_GPIOA
#define 	UFATFS_SCK_SOURCE				 		GPIO_PinSource5
#define		UFATFS_SCK_CLK_Cmd		  	 	RCC_AHB1PeriphClockCmd

#define 	UFATFS_MISO_PIN  				   	GPIO_Pin_6
#define 	UFATFS_MISO_PORT 				  	GPIOA
#define 	UFATFS_MISO_CLK							RCC_AHB1Periph_GPIOA
#define 	UFATFS_MISO_SOURCE				 	GPIO_PinSource6
#define		UFATFS_MISO_CLK_Cmd		  	 	RCC_AHB1PeriphClockCmd

#define 	UFATFS_MOSI_PIN  				   	GPIO_Pin_7
#define 	UFATFS_MOSI_PORT 				  	GPIOA
#define 	UFATFS_MOSI_CLK							RCC_AHB1Periph_GPIOA
#define 	UFATFS_MOSI_SOURCE				 	GPIO_PinSource7
#define		UFATFS_MOSI_CLK_Cmd		  	 	RCC_AHB1PeriphClockCmd

#define		UFATFS_SPI							SPI1
#define 	UFATFS_SPI_CLK					RCC_APB2Periph_SPI1
#define		UFATFS_SPI_CLK_Cmd		  RCC_APB2PeriphClockCmd
#define		UFATFS_SPI_AF						GPIO_AF_SPI1
#define 	UFATFS_SPI_IRQn					SPI1_IRQn

#define		UFATFS_SPI_IRQHandler		SPI1_IRQHandler

/* MMC/SD command */
#define	MMC_CD		!(GPIO_ReadInputDataBit(UFATFS_CD_PORT,UFATFS_CD_PIN))	/* Card detect (yes:true, no:false, default:true) */
#define	MMC_WP		0 /* Write protected (yes:true, no:false, default:false) */

#define CMD0	(0)			/* GO_IDLE_STATE */
#define CMD1	(1)			/* SEND_OP_COND (MMC) */
#define	ACMD41	(0x80+41)	/* SEND_OP_COND (SDC) */
#define CMD8	(8)			/* SEND_IF_COND */
#define CMD9	(9)			/* SEND_CSD */
#define CMD10	(10)		/* SEND_CID */
#define CMD12	(12)		/* STOP_TRANSMISSION */
#define ACMD13	(0x80+13)	/* SD_STATUS (SDC) */
#define CMD16	(16)		/* SET_BLOCKLEN */
#define CMD17	(17)		/* READ_SINGLE_BLOCK */
#define CMD18	(18)		/* READ_MULTIPLE_BLOCK */
#define CMD23	(23)		/* SET_BLOCK_COUNT (MMC) */
#define	ACMD23	(0x80+23)	/* SET_WR_BLK_ERASE_COUNT (SDC) */
#define CMD24	(24)		/* WRITE_BLOCK */
#define CMD25	(25)		/* WRITE_MULTIPLE_BLOCK */
#define CMD32	(32)		/* ERASE_ER_BLK_START */
#define CMD33	(33)		/* ERASE_ER_BLK_END */
#define CMD38	(38)		/* ERASE */
#define CMD55	(55)		/* APP_CMD */
#define CMD58	(58)		/* READ_OCR */

#define CS_HIGH()	GPIO_SetBits(UFATFS_NSS_PORT, UFATFS_NSS_PIN)
#define CS_LOW()	GPIO_ResetBits(UFATFS_NSS_PORT, UFATFS_NSS_PIN)

/* Card type flags (CardType) */
#define CT_MMC		0x01		/* MMC ver 3 */
#define CT_SD1		0x02		/* SD ver 1 */
#define CT_SD2		0x04		/* SD ver 2 */
#define CT_SDC		0x06		/* SD */
#define CT_BLOCK	0x08		/* Block addressing */

static volatile
DSTATUS Stat = STA_NOINIT;	/* Physical drive status */

static volatile
UINT Timer1, Timer2;	/* 1kHz decrement timer stopped at zero (disk_timerproc()) */

static
BYTE CardType;			/* Card type flags */

static SPI_InitTypeDef SPI_InitStruct;

/* Mode of SPI */
typedef enum {
	MODE_8BIT = 0,
	MODE_16BIT
} UFATFS_SPI_ModeBits;

/*-----------------------------------------------------------------------*/
/* SPI controls (Platform dependent)                                     */
/*-----------------------------------------------------------------------*/

/*---------------------------------------------------------*/
/* User provided RTC function for FatFs module             */
/*---------------------------------------------------------*/
/* This is a real time clock service to be called back     */
/* from FatFs module.                                      */

#if !FF_FS_NORTC && !FF_FS_READONLY
DWORD get_fattime (void)
{
	RTCTIME rtc;

	/* Get local time */
	if (!rtc_gettime(&rtc)) return 0;

	/* Pack date and time into a DWORD variable */
	return	  ((DWORD)(rtc.year - 1980) << 25)
			| ((DWORD)rtc.month << 21)
			| ((DWORD)rtc.mday << 16)
			| ((DWORD)rtc.hour << 11)
			| ((DWORD)rtc.min << 5)
			| ((DWORD)rtc.sec >> 1);
}
#endif

static void FCLK_SLOW() 
{ 
	SPI_Cmd(UFATFS_SPI, DISABLE); 
	SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_64;
	SPI_Init(UFATFS_SPI, &SPI_InitStruct); 
	SPI_Cmd(UFATFS_SPI, ENABLE); 	
}	/* Set SCLK = PCLK / 64 */

static void FCLK_FAST() 
{ 
	SPI_Cmd(UFATFS_SPI, DISABLE); 
	SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
	SPI_Init(UFATFS_SPI, &SPI_InitStruct); 
	SPI_Cmd(UFATFS_SPI, ENABLE); 	
}	/* Set SCLK = PCLK / 2 */

static void SPI_MODE8BITS() 
{ 
	SPI_Cmd(UFATFS_SPI, DISABLE); 
	SPI_InitStruct.SPI_DataSize = SPI_DataSize_8b;
	SPI_Init(UFATFS_SPI, &SPI_InitStruct); 
	SPI_Cmd(UFATFS_SPI, ENABLE); 
}

