thanhhaibk96/ARM-Microcontroller-Projects/AUV_Board_STM32F4_1_v3_edited_for_project/FatFs/diskio.c
static void SPI_MODE16BITS() 
{ 
	SPI_Cmd(UFATFS_SPI, DISABLE); 
	SPI_InitStruct.SPI_DataSize = SPI_DataSize_16b;
	SPI_Init(UFATFS_SPI, &SPI_InitStruct); 
	SPI_Cmd(UFATFS_SPI, ENABLE); 
}

static
void timer_configuration(void)
{
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStruct;
	NVIC_InitTypeDef NVIC_InitStruct;
	
	UFATFS_TIM_CLK_Cmd(UFATFS_TIM_CLK, ENABLE);		
	TIM_TimeBaseStruct.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStruct.TIM_Prescaler = ((SystemCoreClock/4)/100000) * 2 - 1;     
  TIM_TimeBaseStruct.TIM_Period = 100 - 1;
	TIM_TimeBaseInit(UFATFS_TIM, &TIM_TimeBaseStruct);
	TIM_ITConfig(UFATFS_TIM,TIM_IT_Update,ENABLE);
	
	NVIC_InitStruct.NVIC_IRQChannel = UFATFS_TIM_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 2;
	NVIC_Init(&NVIC_InitStruct);
	
	TIM_Cmd(UFATFS_TIM, ENABLE);
}

static 
void gpio_configuration(void)
{
	GPIO_InitTypeDef GPIO_InitStruct;
	
	//Set up SPI port A (Structure in STM32f4 User_manual page 36)
	UFATFS_SCK_CLK_Cmd(UFATFS_SCK_CLK, ENABLE);
	GPIO_InitStruct.GPIO_Pin = UFATFS_SCK_PIN;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;															//GPIO Alternate function Mode
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(UFATFS_SCK_PORT, &GPIO_InitStruct);	
	GPIO_PinAFConfig(UFATFS_SCK_PORT, UFATFS_SCK_SOURCE, UFATFS_SPI_AF);
	
	UFATFS_MISO_CLK_Cmd(UFATFS_MISO_CLK, ENABLE);
	GPIO_InitStruct.GPIO_Pin = UFATFS_MISO_PIN;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;															//GPIO Alternate function Mode
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(UFATFS_MISO_PORT, &GPIO_InitStruct);	
	GPIO_PinAFConfig(UFATFS_MISO_PORT, UFATFS_MISO_SOURCE, UFATFS_SPI_AF);
	
	UFATFS_MOSI_CLK_Cmd(UFATFS_MOSI_CLK, ENABLE);
	GPIO_InitStruct.GPIO_Pin = UFATFS_MOSI_PIN;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;															//GPIO Alternate function Mode
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(UFATFS_MOSI_PORT, &GPIO_InitStruct);
	GPIO_PinAFConfig(UFATFS_MOSI_PORT, UFATFS_MOSI_SOURCE, UFATFS_SPI_AF);
	
	//The SS(slave select) is PA4 (Structure in STM32f4 User_manual page 36)
	UFATFS_NSS_CLK_Cmd(UFATFS_NSS_CLK, ENABLE);
	GPIO_InitStruct.GPIO_Pin = UFATFS_NSS_PIN;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(UFATFS_NSS_PORT, &GPIO_InitStruct);
	
	//The CD(card delect) is PC4
	UFATFS_CD_CLK_Cmd(UFATFS_CD_CLK, ENABLE);
	GPIO_InitStruct.GPIO_Pin = UFATFS_CD_PIN;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(UFATFS_CD_PORT, &GPIO_InitStruct);
	
	CS_HIGH();
}

static 
void spi_configuration(void)
{	
	SPI_DeInit(UFATFS_SPI);
	/* SPI_MASTER configuration ------------------------------------------------*/
	UFATFS_SPI_CLK_Cmd(UFATFS_SPI_CLK, ENABLE);
	SPI_InitStruct.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitStruct.SPI_Mode = SPI_Mode_Master;
	
	SPI_InitStruct.SPI_DataSize = SPI_DataSize_8b;
	
	SPI_InitStruct.SPI_CPOL = SPI_CPOL_Low;																//Clock is high when idle
	SPI_InitStruct.SPI_CPHA = SPI_CPHA_1Edge;															//Data is sampled at the second edge
	SPI_InitStruct.SPI_NSS = SPI_NSS_Soft|SPI_NSSInternalSoft_Set;					//Pick SS(slave select) port by software when want to receive from slave
	
	SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;	
	
	SPI_InitStruct.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_Init(UFATFS_SPI, &SPI_InitStruct);
	
	SPI_Cmd(UFATFS_SPI, ENABLE);
}

/* Initialize MMC interface */
static
void init_spi (void)
{
	gpio_configuration();
	spi_configuration();		/* Enable SPI function */
	timer_configuration();
	CS_HIGH();			/* Set CS# high */

	UDELAY_ms(10);	/* 10ms */
}


/* Exchange a byte */
static
BYTE xchg_spi (
	BYTE dat	/* Data to send */
)
{
	SPI_I2S_SendData(UFATFS_SPI, dat);
	while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_TXE) == RESET);			//Wait for transmit. Transmit OK, turn on FLAG_TXE
	while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_RXNE) == RESET);			//Wait for receive. Receive OK, turn on FLAG_RXNE
	return SPI_I2S_ReceiveData(UFATFS_SPI);		/* Return received byte */
}


/* Receive multiple byte */
static
void rcvr_spi_multi (
	BYTE *buff,		/* Pointer to data buffer */
	UINT btr		/* Number of bytes to receive (even number) */
)
{
	WORD d;


	SPI_MODE16BITS(); /* Put SPI into 16-bit mode */

	SPI_I2S_SendData(UFATFS_SPI, 0xFFFF);		/* Start the first SPI transaction */
	btr -= 2;
	do {					/* Receive the data block into buffer */
		while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_TXE) == RESET);	/* Wait for end of the SPI transaction */
		while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_RXNE) == RESET);
		d = SPI_I2S_ReceiveData(UFATFS_SPI);						/* Get received word */
		SPI_I2S_SendData(UFATFS_SPI, 0xFFFF);					/* Start next transaction */
		buff[1] = d; buff[0] = d >> 8; 		/* Store received data */
		buff += 2;
	} while (btr -= 2);
	while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_TXE) == RESET);	/* Wait for end of the SPI transaction */
	while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_RXNE) == RESET);
	d = SPI_I2S_ReceiveData(UFATFS_SPI);							/* Get last word received */
	buff[1] = d; buff[0] = d >> 8;			/* Store it */

	SPI_MODE8BITS();	/* Put SPI into 8-bit mode */
}


#if FF_FS_READONLY == 0
/* Send multiple byte */
static
void xmit_spi_multi (
	const BYTE *buff,	/* Pointer to the data */
	UINT btx			/* Number of bytes to send (even number) */
)
{
	WORD d;

	SPI_MODE16BITS();		/* Put SPI into 16-bit mode */

	d = buff[0] << 8 | buff[1]; buff += 2;
	SPI_I2S_SendData(UFATFS_SPI, d);	/* Send the first word */
	btx -= 2;
	do {
		d = buff[0] << 8 | buff[1]; buff += 2;	/* Word to send next */
		while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_TXE) == RESET);	/* Wait for end of the SPI transaction */
		while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_RXNE) == RESET);
		(void)SPI_I2S_ReceiveData(UFATFS_SPI);							/* Discard received word */
		SPI_I2S_SendData(UFATFS_SPI, d);						/* Start next transaction */
	} while (btx -= 2);
	while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_TXE) == RESET);	/* Wait for end of the SPI transaction */
	while(SPI_I2S_GetFlagStatus(UFATFS_SPI, SPI_I2S_FLAG_RXNE) == RESET);
	(void)SPI_I2S_ReceiveData(UFATFS_SPI);							/* Discard received word */

